// Задание №1
// Склонировать содержимое моего репозитория,
// поэкспериментировать с гитом, попробовать работу через терминал
// и через VSCode. Домашнее задание выложить в репозиторий и
// ссылку разместить в таблице с ДЗ.

// ответ:
// все получилось но я накосячил сначала и удалил с компа файлы всего курса
// потом подразобрался, файлы успел закомитить и соответвенно восстановил с гита. 
//  создал новый бранч и в него закомитил уже то что нужно было на уроке-видео.  остались вопросы 
//  1. Как посмотреть содержимое локального гита и отредактировать?
//  2. как правильно сделать выгрузку в новый репозиторий только определенные файлы если ранее уже выгрузил все содержимое папки в бранче основном. Правильно ли я понял что нужно новый бранч создавать?

let myBrain = 'loaded full';
console.log(myBrain);

// Задание №2
// 1. Простые данные
// Задача: В переменной хранится возраст пользователя. Ему может
// быть 0 лет.
// Как назвать переменную?
let userAge = 0;
// 2. Флаги состояния
// Задача: Нужно отслеживать, авторизован ли пользователь на сайте.
// Как назвать переменную?
let isLoggedIn = false;

// 3. Коллекции элементов
// Задача: В переменной хранится список всех товаров в корзине
// интернет-магазина.
// Как назвать переменную?
let shoppingCart = {
        apple:1,
        pen:2,
        PC:1
    };

console.log(shoppingCart);

// 4. Сложные данные (объект)
// Задача: В переменной хранится информация о книге: её название,
// автор, год издания и количество страниц.
// Как назвать переменную для всей книги? А для свойств внутри неё?
let book ={
    bookName:'',
    bookAutor:0,
    bookPublicationYear:0000,
    bookPages:0000

};
console.log(book);

// 5. Вычисляемые значения
// Задача: В переменную записывается общая сумма всех товаров в
// корзине после применения всех скидок.
// Как назвать переменную?
let finalAmount = 1;

// 6. События и таймеры
// Задача: В переменной хранится ID таймера, который запускает
// какое-то действие каждые 5 секунд. Эта переменная нужна, чтобы
// позже можно было этот таймер остановить.
// Как назвать переменную?
let timerId = "taimer";

// 7. Элементы DOM
// Задача: Нужно работать с кнопкой в интерфейсе, при нажатии на
// которую открывается модальное окно.
// Как назвать переменную, которая ссылается на эту HTML-кнопку?
let confirmButton = undefined;
console.log(confirmButton);

// 8. Булевы значения (да/нет)
// Задача: Переменная отвечает на вопрос: "Отображен ли сейчас
// этот попап на экране?"
// Как назвать переменную?

let isDisplayed = false;

// 9. Строки для отображения
// Задача: В переменной собирается приветственное сообщение для
// пользователя, например, "Добро пожаловать, [Имя]!".
// Как назвать переменную?

let greetingUser = "Добро пожаловать";
console.log(greetingUser);

// 10. Функции-обработчики*
// Задача: Создаётся функция, которая будет вызвана при отправке
// пользователем формы регистрации.
// Как назвать эту функцию?

function confirmRegistration() {

};
